MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB606/mcu.h
#define _IPC28_U6TXIP_POSITION                   0x0000000C
#define _IPC28_U6TXIP_MASK                       0x00007000
#define _IPC28_U6TXIP_LENGTH                     0x00000003

#define _IPC28_U5TXIP0_POSITION                  0x00000000
#define _IPC28_U5TXIP0_MASK                      0x00000001
#define _IPC28_U5TXIP0_LENGTH                    0x00000001

#define _IPC28_U5TXIP1_POSITION                  0x00000001
#define _IPC28_U5TXIP1_MASK                      0x00000002
#define _IPC28_U5TXIP1_LENGTH                    0x00000001

#define _IPC28_U5TXIP2_POSITION                  0x00000002
#define _IPC28_U5TXIP2_MASK                      0x00000004
#define _IPC28_U5TXIP2_LENGTH                    0x00000001

#define _IPC28_U5ERIP0_POSITION                  0x00000004
#define _IPC28_U5ERIP0_MASK                      0x00000010
#define _IPC28_U5ERIP0_LENGTH                    0x00000001

#define _IPC28_U5ERIP1_POSITION                  0x00000005
#define _IPC28_U5ERIP1_MASK                      0x00000020
#define _IPC28_U5ERIP1_LENGTH                    0x00000001

#define _IPC28_U5ERIP2_POSITION                  0x00000006
#define _IPC28_U5ERIP2_MASK                      0x00000040
#define _IPC28_U5ERIP2_LENGTH                    0x00000001

#define _IPC28_U6RXIP0_POSITION                  0x00000008
#define _IPC28_U6RXIP0_MASK                      0x00000100
#define _IPC28_U6RXIP0_LENGTH                    0x00000001

#define _IPC28_U6RXIP1_POSITION                  0x00000009
#define _IPC28_U6RXIP1_MASK                      0x00000200
#define _IPC28_U6RXIP1_LENGTH                    0x00000001

#define _IPC28_U6RXIP2_POSITION                  0x0000000A
#define _IPC28_U6RXIP2_MASK                      0x00000400
#define _IPC28_U6RXIP2_LENGTH                    0x00000001

#define _IPC28_U6TXIP0_POSITION                  0x0000000C
#define _IPC28_U6TXIP0_MASK                      0x00001000
#define _IPC28_U6TXIP0_LENGTH                    0x00000001

#define _IPC28_U6TXIP1_POSITION                  0x0000000D
#define _IPC28_U6TXIP1_MASK                      0x00002000
#define _IPC28_U6TXIP1_LENGTH                    0x00000001

#define _IPC28_U6TXIP2_POSITION                  0x0000000E
#define _IPC28_U6TXIP2_MASK                      0x00004000
#define _IPC28_U6TXIP2_LENGTH                    0x00000001

#define _IPC29_U6ERIP_POSITION                   0x00000000
#define _IPC29_U6ERIP_MASK                       0x00000007
#define _IPC29_U6ERIP_LENGTH                     0x00000003

#define _IPC29_JTAGIP_POSITION                   0x00000004
#define _IPC29_JTAGIP_MASK                       0x00000070
#define _IPC29_JTAGIP_LENGTH                     0x00000003

#define _IPC29_U6ERIP0_POSITION                  0x00000000
#define _IPC29_U6ERIP0_MASK                      0x00000001
#define _IPC29_U6ERIP0_LENGTH                    0x00000001

#define _IPC29_U6ERIP1_POSITION                  0x00000001
#define _IPC29_U6ERIP1_MASK                      0x00000002
#define _IPC29_U6ERIP1_LENGTH                    0x00000001

#define _IPC29_U6ERIP2_POSITION                  0x00000002
#define _IPC29_U6ERIP2_MASK                      0x00000004
#define _IPC29_U6ERIP2_LENGTH                    0x00000001

#define _IPC29_JTAGIP0_POSITION                  0x00000004
#define _IPC29_JTAGIP0_MASK                      0x00000010
#define _IPC29_JTAGIP0_LENGTH                    0x00000001

#define _IPC29_JTAGIP1_POSITION                  0x00000005
#define _IPC29_JTAGIP1_MASK                      0x00000020
#define _IPC29_JTAGIP1_LENGTH                    0x00000001

#define _IPC29_JTAGIP2_POSITION                  0x00000006
#define _IPC29_JTAGIP2_MASK                      0x00000040
#define _IPC29_JTAGIP2_LENGTH                    0x00000001

#define _INTTREG_VECNUM_POSITION                 0x00000000
#define _INTTREG_VECNUM_MASK                     0x000000FF
#define _INTTREG_VECNUM_LENGTH                   0x00000008

#define _INTTREG_ILR_POSITION                    0x00000008
#define _INTTREG_ILR_MASK                        0x00000F00
#define _INTTREG_ILR_LENGTH                      0x00000004

#define _INTTREG_VHOLD_POSITION                  0x0000000D
#define _INTTREG_VHOLD_MASK                      0x00002000
#define _INTTREG_VHOLD_LENGTH                    0x00000001

#define _INTTREG_CPUIRQ_POSITION                 0x0000000F
#define _INTTREG_CPUIRQ_MASK                     0x00008000
#define _INTTREG_CPUIRQ_LENGTH                   0x00000001

#define _INTTREG_VECNUM0_POSITION                0x00000000
#define _INTTREG_VECNUM0_MASK                    0x00000001
#define _INTTREG_VECNUM0_LENGTH                  0x00000001

#define _INTTREG_VECNUM1_POSITION                0x00000001
#define _INTTREG_VECNUM1_MASK                    0x00000002
#define _INTTREG_VECNUM1_LENGTH                  0x00000001

#define _INTTREG_VECNUM2_POSITION                0x00000002
#define _INTTREG_VECNUM2_MASK                    0x00000004
#define _INTTREG_VECNUM2_LENGTH                  0x00000001

#define _INTTREG_VECNUM3_POSITION                0x00000003
#define _INTTREG_VECNUM3_MASK                    0x00000008
#define _INTTREG_VECNUM3_LENGTH                  0x00000001

#define _INTTREG_VECNUM4_POSITION                0x00000004
#define _INTTREG_VECNUM4_MASK                    0x00000010
#define _INTTREG_VECNUM4_LENGTH                  0x00000001

#define _INTTREG_VECNUM5_POSITION                0x00000005
#define _INTTREG_VECNUM5_MASK                    0x00000020
#define _INTTREG_VECNUM5_LENGTH                  0x00000001

#define _INTTREG_VECNUM6_POSITION                0x00000006
#define _INTTREG_VECNUM6_MASK                    0x00000040
#define _INTTREG_VECNUM6_LENGTH                  0x00000001

#define _INTTREG_VECNUM7_POSITION                0x00000007
#define _INTTREG_VECNUM7_MASK                    0x00000080
#define _INTTREG_VECNUM7_LENGTH                  0x00000001

#define _INTTREG_ILR0_POSITION                   0x00000008
#define _INTTREG_ILR0_MASK                       0x00000100
#define _INTTREG_ILR0_LENGTH                     0x00000001

#define _INTTREG_ILR1_POSITION                   0x00000009
#define _INTTREG_ILR1_MASK                       0x00000200
#define _INTTREG_ILR1_LENGTH                     0x00000001

#define _INTTREG_ILR2_POSITION                   0x0000000A
#define _INTTREG_ILR2_MASK                       0x00000400
#define _INTTREG_ILR2_LENGTH                     0x00000001

#define _INTTREG_ILR3_POSITION                   0x0000000B
#define _INTTREG_ILR3_MASK                       0x00000800
#define _INTTREG_ILR3_LENGTH                     0x00000001

#define _OSCCON_OSWEN_POSITION                   0x00000000
#define _OSCCON_OSWEN_MASK                       0x00000001
#define _OSCCON_OSWEN_LENGTH                     0x00000001

#define _OSCCON_SOSCEN_POSITION                  0x00000001
#define _OSCCON_SOSCEN_MASK                      0x00000002
#define _OSCCON_SOSCEN_LENGTH                    0x00000001

#define _OSCCON_POSCEN_POSITION                  0x00000002
#define _OSCCON_POSCEN_MASK                      0x00000004
#define _OSCCON_POSCEN_LENGTH                    0x00000001

