MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB606/mcu.h
#define _U1ADMD_ADMADDR5_POSITION                0x00000005
#define _U1ADMD_ADMADDR5_MASK                    0x00000020
#define _U1ADMD_ADMADDR5_LENGTH                  0x00000001

#define _U1ADMD_ADMADDR6_POSITION                0x00000006
#define _U1ADMD_ADMADDR6_MASK                    0x00000040
#define _U1ADMD_ADMADDR6_LENGTH                  0x00000001

#define _U1ADMD_ADMADDR7_POSITION                0x00000007
#define _U1ADMD_ADMADDR7_MASK                    0x00000080
#define _U1ADMD_ADMADDR7_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK0_POSITION                0x00000008
#define _U1ADMD_ADMMASK0_MASK                    0x00000100
#define _U1ADMD_ADMMASK0_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK1_POSITION                0x00000009
#define _U1ADMD_ADMMASK1_MASK                    0x00000200
#define _U1ADMD_ADMMASK1_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK2_POSITION                0x0000000A
#define _U1ADMD_ADMMASK2_MASK                    0x00000400
#define _U1ADMD_ADMMASK2_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK3_POSITION                0x0000000B
#define _U1ADMD_ADMMASK3_MASK                    0x00000800
#define _U1ADMD_ADMMASK3_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK4_POSITION                0x0000000C
#define _U1ADMD_ADMMASK4_MASK                    0x00001000
#define _U1ADMD_ADMMASK4_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK5_POSITION                0x0000000D
#define _U1ADMD_ADMMASK5_MASK                    0x00002000
#define _U1ADMD_ADMMASK5_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK6_POSITION                0x0000000E
#define _U1ADMD_ADMMASK6_MASK                    0x00004000
#define _U1ADMD_ADMMASK6_LENGTH                  0x00000001

#define _U1ADMD_ADMMASK7_POSITION                0x0000000F
#define _U1ADMD_ADMMASK7_MASK                    0x00008000
#define _U1ADMD_ADMMASK7_LENGTH                  0x00000001

#define _U2MODE_STSEL_POSITION                   0x00000000
#define _U2MODE_STSEL_MASK                       0x00000001
#define _U2MODE_STSEL_LENGTH                     0x00000001

#define _U2MODE_PDSEL_POSITION                   0x00000001
#define _U2MODE_PDSEL_MASK                       0x00000006
#define _U2MODE_PDSEL_LENGTH                     0x00000002

#define _U2MODE_BRGH_POSITION                    0x00000003
#define _U2MODE_BRGH_MASK                        0x00000008
#define _U2MODE_BRGH_LENGTH                      0x00000001

#define _U2MODE_URXINV_POSITION                  0x00000004
#define _U2MODE_URXINV_MASK                      0x00000010
#define _U2MODE_URXINV_LENGTH                    0x00000001

#define _U2MODE_ABAUD_POSITION                   0x00000005
#define _U2MODE_ABAUD_MASK                       0x00000020
#define _U2MODE_ABAUD_LENGTH                     0x00000001

#define _U2MODE_LPBACK_POSITION                  0x00000006
#define _U2MODE_LPBACK_MASK                      0x00000040
#define _U2MODE_LPBACK_LENGTH                    0x00000001

#define _U2MODE_WAKE_POSITION                    0x00000007
#define _U2MODE_WAKE_MASK                        0x00000080
#define _U2MODE_WAKE_LENGTH                      0x00000001

#define _U2MODE_UEN_POSITION                     0x00000008
#define _U2MODE_UEN_MASK                         0x00000300
#define _U2MODE_UEN_LENGTH                       0x00000002

#define _U2MODE_RTSMD_POSITION                   0x0000000B
#define _U2MODE_RTSMD_MASK                       0x00000800
#define _U2MODE_RTSMD_LENGTH                     0x00000001

#define _U2MODE_IREN_POSITION                    0x0000000C
#define _U2MODE_IREN_MASK                        0x00001000
#define _U2MODE_IREN_LENGTH                      0x00000001

#define _U2MODE_USIDL_POSITION                   0x0000000D
#define _U2MODE_USIDL_MASK                       0x00002000
#define _U2MODE_USIDL_LENGTH                     0x00000001

#define _U2MODE_UARTEN_POSITION                  0x0000000F
#define _U2MODE_UARTEN_MASK                      0x00008000
#define _U2MODE_UARTEN_LENGTH                    0x00000001

#define _U2MODE_PDSEL0_POSITION                  0x00000001
#define _U2MODE_PDSEL0_MASK                      0x00000002
#define _U2MODE_PDSEL0_LENGTH                    0x00000001

#define _U2MODE_PDSEL1_POSITION                  0x00000002
#define _U2MODE_PDSEL1_MASK                      0x00000004
#define _U2MODE_PDSEL1_LENGTH                    0x00000001

#define _U2MODE_RXINV_POSITION                   0x00000004
#define _U2MODE_RXINV_MASK                       0x00000010
#define _U2MODE_RXINV_LENGTH                     0x00000001

#define _U2MODE_UEN0_POSITION                    0x00000008
#define _U2MODE_UEN0_MASK                        0x00000100
#define _U2MODE_UEN0_LENGTH                      0x00000001

#define _U2MODE_UEN1_POSITION                    0x00000009
#define _U2MODE_UEN1_MASK                        0x00000200
#define _U2MODE_UEN1_LENGTH                      0x00000001

#define _U2STA_URXDA_POSITION                    0x00000000
#define _U2STA_URXDA_MASK                        0x00000001
#define _U2STA_URXDA_LENGTH                      0x00000001

#define _U2STA_OERR_POSITION                     0x00000001
#define _U2STA_OERR_MASK                         0x00000002
#define _U2STA_OERR_LENGTH                       0x00000001

#define _U2STA_FERR_POSITION                     0x00000002
#define _U2STA_FERR_MASK                         0x00000004
#define _U2STA_FERR_LENGTH                       0x00000001

#define _U2STA_PERR_POSITION                     0x00000003
#define _U2STA_PERR_MASK                         0x00000008
#define _U2STA_PERR_LENGTH                       0x00000001

#define _U2STA_RIDLE_POSITION                    0x00000004
#define _U2STA_RIDLE_MASK                        0x00000010
#define _U2STA_RIDLE_LENGTH                      0x00000001

#define _U2STA_ADDEN_POSITION                    0x00000005
#define _U2STA_ADDEN_MASK                        0x00000020
#define _U2STA_ADDEN_LENGTH                      0x00000001

