MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB606/mcu.h
#define _IOCPDE_CNPDE6_POSITION                  0x00000006
#define _IOCPDE_CNPDE6_MASK                      0x00000040
#define _IOCPDE_CNPDE6_LENGTH                    0x00000001

#define _IOCPDE_CNPDE7_POSITION                  0x00000007
#define _IOCPDE_CNPDE7_MASK                      0x00000080
#define _IOCPDE_CNPDE7_LENGTH                    0x00000001

#define _TRISF_TRISF0_POSITION                   0x00000000
#define _TRISF_TRISF0_MASK                       0x00000001
#define _TRISF_TRISF0_LENGTH                     0x00000001

#define _TRISF_TRISF1_POSITION                   0x00000001
#define _TRISF_TRISF1_MASK                       0x00000002
#define _TRISF_TRISF1_LENGTH                     0x00000001

#define _TRISF_TRISF3_POSITION                   0x00000003
#define _TRISF_TRISF3_MASK                       0x00000008
#define _TRISF_TRISF3_LENGTH                     0x00000001

#define _TRISF_TRISF4_POSITION                   0x00000004
#define _TRISF_TRISF4_MASK                       0x00000010
#define _TRISF_TRISF4_LENGTH                     0x00000001

#define _TRISF_TRISF5_POSITION                   0x00000005
#define _TRISF_TRISF5_MASK                       0x00000020
#define _TRISF_TRISF5_LENGTH                     0x00000001

#define _TRISF_TRISF7_POSITION                   0x00000007
#define _TRISF_TRISF7_MASK                       0x00000080
#define _TRISF_TRISF7_LENGTH                     0x00000001

#define _PORTF_RF0_POSITION                      0x00000000
#define _PORTF_RF0_MASK                          0x00000001
#define _PORTF_RF0_LENGTH                        0x00000001

#define _PORTF_RF1_POSITION                      0x00000001
#define _PORTF_RF1_MASK                          0x00000002
#define _PORTF_RF1_LENGTH                        0x00000001

#define _PORTF_RF3_POSITION                      0x00000003
#define _PORTF_RF3_MASK                          0x00000008
#define _PORTF_RF3_LENGTH                        0x00000001

#define _PORTF_RF4_POSITION                      0x00000004
#define _PORTF_RF4_MASK                          0x00000010
#define _PORTF_RF4_LENGTH                        0x00000001

#define _PORTF_RF5_POSITION                      0x00000005
#define _PORTF_RF5_MASK                          0x00000020
#define _PORTF_RF5_LENGTH                        0x00000001

#define _PORTF_RF7_POSITION                      0x00000007
#define _PORTF_RF7_MASK                          0x00000080
#define _PORTF_RF7_LENGTH                        0x00000001

#define _LATF_LATF0_POSITION                     0x00000000
#define _LATF_LATF0_MASK                         0x00000001
#define _LATF_LATF0_LENGTH                       0x00000001

#define _LATF_LATF1_POSITION                     0x00000001
#define _LATF_LATF1_MASK                         0x00000002
#define _LATF_LATF1_LENGTH                       0x00000001

#define _LATF_LATF3_POSITION                     0x00000003
#define _LATF_LATF3_MASK                         0x00000008
#define _LATF_LATF3_LENGTH                       0x00000001

#define _LATF_LATF4_POSITION                     0x00000004
#define _LATF_LATF4_MASK                         0x00000010
#define _LATF_LATF4_LENGTH                       0x00000001

#define _LATF_LATF5_POSITION                     0x00000005
#define _LATF_LATF5_MASK                         0x00000020
#define _LATF_LATF5_LENGTH                       0x00000001

#define _LATF_LATF7_POSITION                     0x00000007
#define _LATF_LATF7_MASK                         0x00000080
#define _LATF_LATF7_LENGTH                       0x00000001

#define _ODCF_ODCF0_POSITION                     0x00000000
#define _ODCF_ODCF0_MASK                         0x00000001
#define _ODCF_ODCF0_LENGTH                       0x00000001

#define _ODCF_ODCF1_POSITION                     0x00000001
#define _ODCF_ODCF1_MASK                         0x00000002
#define _ODCF_ODCF1_LENGTH                       0x00000001

#define _ODCF_ODCF3_POSITION                     0x00000003
#define _ODCF_ODCF3_MASK                         0x00000008
#define _ODCF_ODCF3_LENGTH                       0x00000001

#define _ODCF_ODCF4_POSITION                     0x00000004
#define _ODCF_ODCF4_MASK                         0x00000010
#define _ODCF_ODCF4_LENGTH                       0x00000001

#define _ODCF_ODCF5_POSITION                     0x00000005
#define _ODCF_ODCF5_MASK                         0x00000020
#define _ODCF_ODCF5_LENGTH                       0x00000001

#define _ODCF_ODCF7_POSITION                     0x00000007
#define _ODCF_ODCF7_MASK                         0x00000080
#define _ODCF_ODCF7_LENGTH                       0x00000001

#define _IOCPF_IOCPF0_POSITION                   0x00000000
#define _IOCPF_IOCPF0_MASK                       0x00000001
#define _IOCPF_IOCPF0_LENGTH                     0x00000001

#define _IOCPF_IOCPF1_POSITION                   0x00000001
#define _IOCPF_IOCPF1_MASK                       0x00000002
#define _IOCPF_IOCPF1_LENGTH                     0x00000001

#define _IOCPF_IOCPF3_POSITION                   0x00000003
#define _IOCPF_IOCPF3_MASK                       0x00000008
#define _IOCPF_IOCPF3_LENGTH                     0x00000001

#define _IOCPF_IOCPF4_POSITION                   0x00000004
#define _IOCPF_IOCPF4_MASK                       0x00000010
#define _IOCPF_IOCPF4_LENGTH                     0x00000001

#define _IOCPF_IOCPF5_POSITION                   0x00000005
#define _IOCPF_IOCPF5_MASK                       0x00000020
#define _IOCPF_IOCPF5_LENGTH                     0x00000001

#define _IOCPF_IOCPF7_POSITION                   0x00000007
#define _IOCPF_IOCPF7_MASK                       0x00000080
#define _IOCPF_IOCPF7_LENGTH                     0x00000001

#define _IOCNF_IOCNF0_POSITION                   0x00000000
#define _IOCNF_IOCNF0_MASK                       0x00000001
#define _IOCNF_IOCNF0_LENGTH                     0x00000001

#define _IOCNF_IOCNF1_POSITION                   0x00000001
#define _IOCNF_IOCNF1_MASK                       0x00000002
#define _IOCNF_IOCNF1_LENGTH                     0x00000001

#define _IOCNF_IOCNF3_POSITION                   0x00000003
#define _IOCNF_IOCNF3_MASK                       0x00000008
#define _IOCNF_IOCNF3_LENGTH                     0x00000001

