MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB606/mcu.h
#define _IOCPUF_IOCPUF1_POSITION                 0x00000001
#define _IOCPUF_IOCPUF1_MASK                     0x00000002
#define _IOCPUF_IOCPUF1_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF3_POSITION                 0x00000003
#define _IOCPUF_IOCPUF3_MASK                     0x00000008
#define _IOCPUF_IOCPUF3_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF4_POSITION                 0x00000004
#define _IOCPUF_IOCPUF4_MASK                     0x00000010
#define _IOCPUF_IOCPUF4_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF5_POSITION                 0x00000005
#define _IOCPUF_IOCPUF5_MASK                     0x00000020
#define _IOCPUF_IOCPUF5_LENGTH                   0x00000001

#define _IOCPUF_IOCPUF7_POSITION                 0x00000007
#define _IOCPUF_IOCPUF7_MASK                     0x00000080
#define _IOCPUF_IOCPUF7_LENGTH                   0x00000001

#define _IOCPUF_CNPUF0_POSITION                  0x00000000
#define _IOCPUF_CNPUF0_MASK                      0x00000001
#define _IOCPUF_CNPUF0_LENGTH                    0x00000001

#define _IOCPUF_CNPUF1_POSITION                  0x00000001
#define _IOCPUF_CNPUF1_MASK                      0x00000002
#define _IOCPUF_CNPUF1_LENGTH                    0x00000001

#define _IOCPUF_CNPUF3_POSITION                  0x00000003
#define _IOCPUF_CNPUF3_MASK                      0x00000008
#define _IOCPUF_CNPUF3_LENGTH                    0x00000001

#define _IOCPUF_CNPUF4_POSITION                  0x00000004
#define _IOCPUF_CNPUF4_MASK                      0x00000010
#define _IOCPUF_CNPUF4_LENGTH                    0x00000001

#define _IOCPUF_CNPUF5_POSITION                  0x00000005
#define _IOCPUF_CNPUF5_MASK                      0x00000020
#define _IOCPUF_CNPUF5_LENGTH                    0x00000001

#define _IOCPUF_CNPUF7_POSITION                  0x00000007
#define _IOCPUF_CNPUF7_MASK                      0x00000080
#define _IOCPUF_CNPUF7_LENGTH                    0x00000001

#define _CNPDF_IOCPDF0_POSITION                  0x00000000
#define _CNPDF_IOCPDF0_MASK                      0x00000001
#define _CNPDF_IOCPDF0_LENGTH                    0x00000001

#define _CNPDF_IOCPDF1_POSITION                  0x00000001
#define _CNPDF_IOCPDF1_MASK                      0x00000002
#define _CNPDF_IOCPDF1_LENGTH                    0x00000001

#define _CNPDF_IOCPDF3_POSITION                  0x00000003
#define _CNPDF_IOCPDF3_MASK                      0x00000008
#define _CNPDF_IOCPDF3_LENGTH                    0x00000001

#define _CNPDF_IOCPDF4_POSITION                  0x00000004
#define _CNPDF_IOCPDF4_MASK                      0x00000010
#define _CNPDF_IOCPDF4_LENGTH                    0x00000001

#define _CNPDF_IOCPDF5_POSITION                  0x00000005
#define _CNPDF_IOCPDF5_MASK                      0x00000020
#define _CNPDF_IOCPDF5_LENGTH                    0x00000001

#define _CNPDF_IOCPDF7_POSITION                  0x00000007
#define _CNPDF_IOCPDF7_MASK                      0x00000080
#define _CNPDF_IOCPDF7_LENGTH                    0x00000001

#define _CNPDF_CNPDF0_POSITION                   0x00000000
#define _CNPDF_CNPDF0_MASK                       0x00000001
#define _CNPDF_CNPDF0_LENGTH                     0x00000001

#define _CNPDF_CNPDF1_POSITION                   0x00000001
#define _CNPDF_CNPDF1_MASK                       0x00000002
#define _CNPDF_CNPDF1_LENGTH                     0x00000001

#define _CNPDF_CNPDF3_POSITION                   0x00000003
#define _CNPDF_CNPDF3_MASK                       0x00000008
#define _CNPDF_CNPDF3_LENGTH                     0x00000001

#define _CNPDF_CNPDF4_POSITION                   0x00000004
#define _CNPDF_CNPDF4_MASK                       0x00000010
#define _CNPDF_CNPDF4_LENGTH                     0x00000001

#define _CNPDF_CNPDF5_POSITION                   0x00000005
#define _CNPDF_CNPDF5_MASK                       0x00000020
#define _CNPDF_CNPDF5_LENGTH                     0x00000001

#define _CNPDF_CNPDF7_POSITION                   0x00000007
#define _CNPDF_CNPDF7_MASK                       0x00000080
#define _CNPDF_CNPDF7_LENGTH                     0x00000001

#define _IOCPDF_IOCPDF0_POSITION                 0x00000000
#define _IOCPDF_IOCPDF0_MASK                     0x00000001
#define _IOCPDF_IOCPDF0_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF1_POSITION                 0x00000001
#define _IOCPDF_IOCPDF1_MASK                     0x00000002
#define _IOCPDF_IOCPDF1_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF3_POSITION                 0x00000003
#define _IOCPDF_IOCPDF3_MASK                     0x00000008
#define _IOCPDF_IOCPDF3_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF4_POSITION                 0x00000004
#define _IOCPDF_IOCPDF4_MASK                     0x00000010
#define _IOCPDF_IOCPDF4_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF5_POSITION                 0x00000005
#define _IOCPDF_IOCPDF5_MASK                     0x00000020
#define _IOCPDF_IOCPDF5_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF7_POSITION                 0x00000007
#define _IOCPDF_IOCPDF7_MASK                     0x00000080
#define _IOCPDF_IOCPDF7_LENGTH                   0x00000001

#define _IOCPDF_CNPDF0_POSITION                  0x00000000
#define _IOCPDF_CNPDF0_MASK                      0x00000001
#define _IOCPDF_CNPDF0_LENGTH                    0x00000001

#define _IOCPDF_CNPDF1_POSITION                  0x00000001
#define _IOCPDF_CNPDF1_MASK                      0x00000002
#define _IOCPDF_CNPDF1_LENGTH                    0x00000001

#define _IOCPDF_CNPDF3_POSITION                  0x00000003
#define _IOCPDF_CNPDF3_MASK                      0x00000008
#define _IOCPDF_CNPDF3_LENGTH                    0x00000001

#define _IOCPDF_CNPDF4_POSITION                  0x00000004
#define _IOCPDF_CNPDF4_MASK                      0x00000010
#define _IOCPDF_CNPDF4_LENGTH                    0x00000001

#define _IOCPDF_CNPDF5_POSITION                  0x00000005
#define _IOCPDF_CNPDF5_MASK                      0x00000020
#define _IOCPDF_CNPDF5_LENGTH                    0x00000001

#define _IOCPDF_CNPDF7_POSITION                  0x00000007
#define _IOCPDF_CNPDF7_MASK                      0x00000080
#define _IOCPDF_CNPDF7_LENGTH                    0x00000001

