MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB606/mcu.h
#define _ANSG_ANSELG6_POSITION                   0x00000006
#define _ANSG_ANSELG6_MASK                       0x00000040
#define _ANSG_ANSELG6_LENGTH                     0x00000001

#define _ANSG_ANSELG7_POSITION                   0x00000007
#define _ANSG_ANSELG7_MASK                       0x00000080
#define _ANSG_ANSELG7_LENGTH                     0x00000001

#define _ANSG_ANSELG8_POSITION                   0x00000008
#define _ANSG_ANSELG8_MASK                       0x00000100
#define _ANSG_ANSELG8_LENGTH                     0x00000001

#define _ANSG_ANSELG9_POSITION                   0x00000009
#define _ANSG_ANSELG9_MASK                       0x00000200
#define _ANSG_ANSELG9_LENGTH                     0x00000001

#define _IOCPG_IOCPG2_POSITION                   0x00000002
#define _IOCPG_IOCPG2_MASK                       0x00000004
#define _IOCPG_IOCPG2_LENGTH                     0x00000001

#define _IOCPG_IOCPG3_POSITION                   0x00000003
#define _IOCPG_IOCPG3_MASK                       0x00000008
#define _IOCPG_IOCPG3_LENGTH                     0x00000001

#define _IOCPG_IOCPG6_POSITION                   0x00000006
#define _IOCPG_IOCPG6_MASK                       0x00000040
#define _IOCPG_IOCPG6_LENGTH                     0x00000001

#define _IOCPG_IOCPG7_POSITION                   0x00000007
#define _IOCPG_IOCPG7_MASK                       0x00000080
#define _IOCPG_IOCPG7_LENGTH                     0x00000001

#define _IOCPG_IOCPG8_POSITION                   0x00000008
#define _IOCPG_IOCPG8_MASK                       0x00000100
#define _IOCPG_IOCPG8_LENGTH                     0x00000001

#define _IOCPG_IOCPG9_POSITION                   0x00000009
#define _IOCPG_IOCPG9_MASK                       0x00000200
#define _IOCPG_IOCPG9_LENGTH                     0x00000001

#define _IOCNG_IOCNG2_POSITION                   0x00000002
#define _IOCNG_IOCNG2_MASK                       0x00000004
#define _IOCNG_IOCNG2_LENGTH                     0x00000001

#define _IOCNG_IOCNG3_POSITION                   0x00000003
#define _IOCNG_IOCNG3_MASK                       0x00000008
#define _IOCNG_IOCNG3_LENGTH                     0x00000001

#define _IOCNG_IOCNG6_POSITION                   0x00000006
#define _IOCNG_IOCNG6_MASK                       0x00000040
#define _IOCNG_IOCNG6_LENGTH                     0x00000001

#define _IOCNG_IOCNG7_POSITION                   0x00000007
#define _IOCNG_IOCNG7_MASK                       0x00000080
#define _IOCNG_IOCNG7_LENGTH                     0x00000001

#define _IOCNG_IOCNG8_POSITION                   0x00000008
#define _IOCNG_IOCNG8_MASK                       0x00000100
#define _IOCNG_IOCNG8_LENGTH                     0x00000001

#define _IOCNG_IOCNG9_POSITION                   0x00000009
#define _IOCNG_IOCNG9_MASK                       0x00000200
#define _IOCNG_IOCNG9_LENGTH                     0x00000001

#define _IOCFG_IOCFG2_POSITION                   0x00000002
#define _IOCFG_IOCFG2_MASK                       0x00000004
#define _IOCFG_IOCFG2_LENGTH                     0x00000001

#define _IOCFG_IOCFG3_POSITION                   0x00000003
#define _IOCFG_IOCFG3_MASK                       0x00000008
#define _IOCFG_IOCFG3_LENGTH                     0x00000001

#define _IOCFG_IOCFG6_POSITION                   0x00000006
#define _IOCFG_IOCFG6_MASK                       0x00000040
#define _IOCFG_IOCFG6_LENGTH                     0x00000001

#define _IOCFG_IOCFG7_POSITION                   0x00000007
#define _IOCFG_IOCFG7_MASK                       0x00000080
#define _IOCFG_IOCFG7_LENGTH                     0x00000001

#define _IOCFG_IOCFG8_POSITION                   0x00000008
#define _IOCFG_IOCFG8_MASK                       0x00000100
#define _IOCFG_IOCFG8_LENGTH                     0x00000001

#define _IOCFG_IOCFG9_POSITION                   0x00000009
#define _IOCFG_IOCFG9_MASK                       0x00000200
#define _IOCFG_IOCFG9_LENGTH                     0x00000001

#define _CNPUG_IOCPG2_POSITION                   0x00000002
#define _CNPUG_IOCPG2_MASK                       0x00000004
#define _CNPUG_IOCPG2_LENGTH                     0x00000001

#define _CNPUG_IOCPG3_POSITION                   0x00000003
#define _CNPUG_IOCPG3_MASK                       0x00000008
#define _CNPUG_IOCPG3_LENGTH                     0x00000001

#define _CNPUG_IOCPG6_POSITION                   0x00000006
#define _CNPUG_IOCPG6_MASK                       0x00000040
#define _CNPUG_IOCPG6_LENGTH                     0x00000001

#define _CNPUG_IOCPG7_POSITION                   0x00000007
#define _CNPUG_IOCPG7_MASK                       0x00000080
#define _CNPUG_IOCPG7_LENGTH                     0x00000001

#define _CNPUG_IOCPG8_POSITION                   0x00000008
#define _CNPUG_IOCPG8_MASK                       0x00000100
#define _CNPUG_IOCPG8_LENGTH                     0x00000001

#define _CNPUG_IOCPG9_POSITION                   0x00000009
#define _CNPUG_IOCPG9_MASK                       0x00000200
#define _CNPUG_IOCPG9_LENGTH                     0x00000001

#define _CNPUG_IOCPUG2_POSITION                  0x00000002
#define _CNPUG_IOCPUG2_MASK                      0x00000004
#define _CNPUG_IOCPUG2_LENGTH                    0x00000001

#define _CNPUG_IOCPUG3_POSITION                  0x00000003
#define _CNPUG_IOCPUG3_MASK                      0x00000008
#define _CNPUG_IOCPUG3_LENGTH                    0x00000001

#define _CNPUG_IOCPUG6_POSITION                  0x00000006
#define _CNPUG_IOCPUG6_MASK                      0x00000040
#define _CNPUG_IOCPUG6_LENGTH                    0x00000001

#define _CNPUG_IOCPUG7_POSITION                  0x00000007
#define _CNPUG_IOCPUG7_MASK                      0x00000080
#define _CNPUG_IOCPUG7_LENGTH                    0x00000001

#define _CNPUG_IOCPUG8_POSITION                  0x00000008
#define _CNPUG_IOCPUG8_MASK                      0x00000100
#define _CNPUG_IOCPUG8_LENGTH                    0x00000001

#define _CNPUG_IOCPUG9_POSITION                  0x00000009
#define _CNPUG_IOCPUG9_MASK                      0x00000200
#define _CNPUG_IOCPUG9_LENGTH                    0x00000001

#define _CNPUG_CNPUG2_POSITION                   0x00000002
#define _CNPUG_CNPUG2_MASK                       0x00000004
#define _CNPUG_CNPUG2_LENGTH                     0x00000001

